app/views/picks/new.html.erb

SELECT "teams".* FROM "teams"  WHERE "teams"."draft_id" = ?  [["draft_id", 15]]
---
			<h1>Team 1</h1>
			<%= render @draft.teams.first %>