app/controllers/drafts_controller.rb

SELECT "champions".* FROM "champions"
SELECT "drafts".* FROM "drafts"
INSERT INTO "drafts" DEFAULT VALUES
INSERT INTO "teams" ("draft_id") VALUES (?)  [["draft_id", 1]]
---
  def new
    destroy_previous
    @draft = Draft.new
    @draft.champions = Champion.all
    @draft.teams = [Team.new, Team.new]
    @draft.save

SELECT  "drafts".* FROM "drafts"  WHERE "drafts"."id" = ? LIMIT 1  [["id", 1]]
---
  def find_draft
    Draft.find(params[:id])