app/controllers/drafts_controller.rb

INSERT INTO "drafts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-10-11 23:01:12.855695"], ["updated_at", "2014-10-11 23:01:12.855695"]]
---
  def new
    destroy_previous
    @draft = Draft.new
    @draft.champions = Champion.all
    @draft.teams = [Team.new, Team.new]
    @draft.save

SELECT  "drafts".* FROM "drafts"  WHERE "drafts"."id" = ? LIMIT 1  [["id", 980190962]]
---
  def find_draft
    Draft.find(params[:id])