app/controllers/picks_controller.rb

  def new
    @draft = Draft.find(params[:draft_id])
---
SELECT  "drafts".* FROM "drafts"  WHERE "drafts"."id" = ? LIMIT 1  [["id", 15]]