app/views/drafts/show.html.erb

			<h1>Team 1</h1>
			<%= render @draft.teams.first %>
---
SELECT "teams".* FROM "teams"  WHERE "teams"."draft_id" = ?  [["draft_id", 1]]

		<h2>Remaining Champions</h2>
		<% @draft.champions.each do |champ|%>
---
SELECT "champions".* FROM "champions" INNER JOIN "champions_drafts" ON "champions"."id" = "champions_drafts"."champion_id" WHERE "champions_drafts"."draft_id" = ?  [["draft_id", 1]]